devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
                .IRQn            = UART10_IRQn,
                .IRQ_priority    = __UART_UART10_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART10_DMA_MODE__,
                .DMA_buf_len     = __UART_UART10_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = UINT8_MAX,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART16910_CLKSOURCE,
                #endif
        }
        #endif
};

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param hdl           uart handle
 *
 * @return One of errno value
 */
//==============================================================================
int _UART_LLD__turn_on(struct UART_mem *hdl)
{
        int err = EADDRINUSE;

        const UART_setup_t *SETUP = &UART[hdl->major];

        if (!(*SETUP->APBENR & SETUP->APBENR_UARTEN)) {

                uarthdl_t *uarthdl;
                err = sys_zalloc(sizeof(*uarthdl), cast(void**, &uarthdl));
                if (!err) {

                        if (SETUP->use_DMA) {

                                size_t buf_len = DMA_ALIGN_UP(UART[hdl->major].DMA_buf_len);
                                buf_len = max(_CPUCTL_CACHE_ALIGN, buf_len);

                                uart_dma_t *dmabuf;
                                size_t dma_buf_size = sizeof(*dmabuf) + buf_len + _CPUCTL_CACHE_ALIGN;

                                err = sys_zalloc2(dma_buf_size, NULL, _MM_FLAG__DMA_CAPABLE,
                                                  _MM_FLAG__DMA_CAPABLE, cast(void**, &dmabuf));
                                if (!err) {
                                        dmabuf->buflen = buf_len;
                                        dmabuf->buf    = (void*)DMA_ALIGN_UP((u32_t)&dmabuf->buf_holder);

                                        dmabuf->desc = _DMA_DDI_reserve(SETUP->DMA_major,
                                                                        SETUP->DMA_rx_stream_pri);
                                        if (dmabuf->desc == 0) {
                                                dmabuf->desc = _DMA_DDI_reserve(SETUP->DMA_major,
                                                                                SETUP->DMA_rx_stream_alt);
                                        }

                                        if (dmabuf->desc) {
                                                err = _DMA_DDI_get_stream(dmabuf->desc, &dmabuf->stream);
                                        }

                                        if (err or (dmabuf->desc == 0)) {
                                                dev_dbg(hdl, "DMA not accessible, using IRQ mode", 0);
                                                sys_free(cast(void*, &dmabuf));
                                        } else {
                                                uarthdl->DMA = dmabuf;
                                        }

                                } else {
                                        dev_dbg(hdl, "no free memory to enable DMA mode", 0);
                                }

                                err = 0;
                        }
                }

                if (!err) {
                        hdl->uarthdl = uarthdl;

                        SET_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
                        CLEAR_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
                        SET_BIT(*SETUP->APBENR, SETUP->APBENR_UARTEN);

                        NVIC_EnableIRQ(SETUP->IRQn);
                        NVIC_SetPriority(SETUP->IRQn, SETUP->IRQ_priority);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param hdl           uart handle
 *
 * @return One of errno value.
 */
//==============================================================================
int _UART_LLD__turn_off(struct UART_mem *hdl)
{
        uarthdl_t *uarthdl = hdl->uarthdl;
        const UART_setup_t *SETUP =  &UART[hdl->major];

        if (uarthdl->DMA) {
                _DMA_DDI_release(uarthdl->DMA->desc);
                sys_free(cast(void*, &uarthdl->DMA));
        }

        NVIC_DisableIRQ(SETUP->IRQn);
        SET_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
        CLEAR_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
        CLEAR_BIT(*SETUP->APBENR, SETUP->APBENR_UARTEN);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function resume transmission of buffer.
 *
 * @param hdl           uart handle
 */
//==============================================================================
void _UART_LLD__resume_transmit(struct UART_mem *hdl)
{
        const UART_setup_t *SETUP =  &UART[hdl->major];

        if (!(SETUP->UART->CR1 & USART_CR1_TCIE)) {
                sys_critical_section_begin();

                if (hdl->config.basic.mode == UART_MODE__RS485) {
                        _UART_set_DE_pin(hdl, true);
                }

