devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
                SET_BIT(SETUP->UART->CR1, USART_CR1_TCIE);

                sys_critical_section_end();
        }
}

//==============================================================================
/**
 * @brief Function configure selected UART.
 *
 * @param hdl           uart handle
 * @param config        configuration structure
 */
//==============================================================================
int _UART_LLD__configure(struct UART_mem *hdl, const struct UART_rich_config *config)
{
        uarthdl_t *uarthdl = hdl->uarthdl;
        const UART_setup_t *SETUP = &UART[hdl->major];
        u32_t PCLK = 0;

        /* set baud */
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);

        switch (SETUP->CLKSRC) {
        case USART_CLKSOURCE_PCLK1:
                PCLK = freq.PCLK1_Frequency;
                break;

        case USART_CLKSOURCE_PCLK2:
                PCLK = freq.PCLK2_Frequency;
                break;
        default:
                dev_dbg(hdl, "invalid CLKSRC!", 0);
                break;
        }
#elif defined(ARCH_stm32f7) || defined(ARCH_stm32f3)
        switch (SETUP->CLKSRC) {
        #if defined(LL_RCC_USART1_CLKSOURCE)
        case LL_RCC_USART1_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART2_CLKSOURCE)
        case LL_RCC_USART2_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART3_CLKSOURCE)
        case LL_RCC_USART3_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART6_CLKSOURCE)
        case LL_RCC_USART6_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUSARTClockFreq(SETUP->CLKSRC);
                break;
        #if defined(LL_RCC_UART4_CLKSOURCE)
        case LL_RCC_UART4_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART5_CLKSOURCE)
        case LL_RCC_UART5_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART7_CLKSOURCE)
        case LL_RCC_UART7_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART8_CLKSOURCE)
        case LL_RCC_UART8_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUARTClockFreq(SETUP->CLKSRC);
                break;

        default:
                break;
        }
#elif defined(ARCH_stm32h7)
        PCLK = LL_RCC_GetUSARTClockFreq(SETUP->CLKSRC);
#endif

        SETUP->UART->BRR = (PCLK / (config->basic.baud)) + 1;

        /* set 8 bit word length and wake idle line */
        CLEAR_BIT(SETUP->UART->CR1, USART_CR1_M | USART_CR1_WAKE);

        /* set parity */
        switch (config->basic.parity) {
        case UART_PARITY__OFF:
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__EVEN:
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_PS);
                SET_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__ODD:
                SET_BIT(SETUP->UART->CR1, USART_CR1_PS);
                SET_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        }

        /* transmitter enable */
        if (config->basic.tx_enable) {
                SET_BIT(SETUP->UART->CR1, USART_CR1_TE);
        } else {
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_TE);
        }

        /* receiver enable */
        if (config->basic.rx_enable) {
                SET_BIT(SETUP->UART->CR1, USART_CR1_RE);
        } else {
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_RE);
        }

        /* FIFO enable */
        #if defined(USART_CR1_FIFOEN)
        SET_BIT(SETUP->UART->CR1, USART_CR1_FIFOEN);
        #endif

        /* enable LIN if configured */
        if (config->basic.mode == UART_MODE__LIN) {
                SET_BIT(SETUP->UART->CR2, USART_CR2_LINEN);
        } else {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_LINEN);
        }

        /* configure stop bits */
        if (config->basic.stop_bits == UART_STOP_BIT__1) {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_STOP);
        } else {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_STOP);
                SET_BIT(SETUP->UART->CR2, USART_CR2_STOP_1);
        }

        /* clock configuration (synchronous mode) */
        CLEAR_BIT(SETUP->UART->CR2, USART_CR2_CLKEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL);

        /* LIN break detection length */
        if (config->LIN_break_bits == UART_LIN_BREAK__10_BITS) {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_LBDL);
        } else {
                SET_BIT(SETUP->UART->CR2, USART_CR2_LBDL);
        }

        /* hardware flow control */
        if (config->basic.features & UART_FEATURE__HARDWARE_FLOW_CTRL) {
                SET_BIT(SETUP->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        } else {
                CLEAR_BIT(SETUP->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        }

        /* configure single wire mode */
        if (config->basic.features & UART_FEATURE__SINGLE_WIRE) {
                SET_BIT(SETUP->UART->CR3, USART_CR3_HDSEL);
        } else {
                CLEAR_BIT(SETUP->UART->CR3, USART_CR3_HDSEL);
        }

        if (uarthdl->DMA) {

                _DMA_DDI_config_t dma_conf;
                dma_conf.IRQ_priority = __CPU_DEFAULT_IRQ_PRIORITY__;
                dma_conf.arg       = hdl;
                dma_conf.cb_finish = dma_half_and_finish;
                dma_conf.cb_half   = dma_half_and_finish;
                dma_conf.cb_next   = NULL;
                dma_conf.release   = false;
                dma_conf.NDT       = uarthdl->DMA->buflen;
                dma_conf.PA        = cast(u32_t, &UART[hdl->major].UART->RDR);
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3)
                dma_conf.MA        = cast(u32_t, uarthdl->DMA->buf);
                dma_conf.CR        = DMA_CCRx_MINC_ENABLE
                                   | DMA_CCRx_DIR_P2M
                                   | DMA_CCRx_CIRC_ENABLE
                                   | DMA_CCRx_MSIZE_BYTE
                                   | DMA_CCRx_PSIZE_BYTE;

#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                dma_conf.MA[0]     = cast(u32_t, uarthdl->DMA->buf);
                dma_conf.MA[1]     = 0;
                dma_conf.FC        = 0;
                dma_conf.CR        = DMA_SxCR_CHSEL_SEL(UART[hdl->major].DMA_channel)
                                   | DMA_SxCR_MINC_ENABLE
                                   | DMA_SxCR_DIR_P2M
                                   | DMA_SxCR_CIRC
                                   | DMA_SxCR_MSIZE_BYTE
                                   | DMA_SxCR_PSIZE_BYTE;
#endif

